app/controllers/home_controller.rb

SELECT id, abbreviation, name, north_america FROM "countries"
---
  def index
    @countries = Country.select([:id, :abbreviation, :name, :north_america]);

SELECT "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT 1  [["id", 0]]
---
  def countries
  	@countries = []
  	number_of_countries = Country.all.count
  	counter = params[:step].to_i
		amount = params[:offset].to_i

		if (number_of_countries - counter) < amount
			amount = number_of_countries - counter + 1
		end

		amount.times do
			@countries << Country.find(counter)

SELECT "countries".* FROM "countries"
---
  def all_countries
  	@countries = Country.all